Revit 2026 API

# CeramicCeramicPatternAmount Property

---

The property labeled "Amount" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicPatternAmount { get; }
```
```vb
Public Shared ReadOnly Property CeramicPatternAmount As String
	Get
```
```cpp
public:
static property String^ CeramicPatternAmount {
	String^ get ();
}
```
```fsharp
static member CeramicPatternAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 2".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace